package Lessons.webinar1;

public class Ex2 {
    public static void main(String[] args) {
        int[] nums = new int[]{3,2,5,3};
        int val = 3;
        System.out.println(getReturnA(nums, val));

    }

//Дан массив nums = [3,2,5,3] и число val = 3.
//Если в массиве есть числа,
//равные заданному,
//нужно перенести эти элементы в конец массива.
//Таким образом,
//первые несколько (или все) элементов массива должны быть отличны от заданного,
//а остальные - равны ему.
    static int getResultA(int[] nums, int val){
        int[] temp = new int[]
        for (int i = 0; i < nums.length; i++) {
            if (nums[i] == 3){

            }
        }

    }

    static void start() {

    }


}
